modules/intranet/models/AuthItem.php

    public static function consultarPermisos($usuario) {
        $listPermisos = AuthItem::find()
                ->alias('permiso')
                ->joinWith(['parents as rol', 'parents.authAssignments as rolasignacion'])
                ->where("permiso.type=:tipoPermiso AND rolasignacion.user_id=:usuario")
                ->addParams([':tipoPermiso' => 2, ':usuario' => $usuario])
                ->all();
---
SELECT `permiso`.* FROM `auth_item` `permiso` LEFT JOIN `auth_item_child` ON `permiso`.`name` = `auth_item_child`.`child` LEFT JOIN `auth_item` `rol` ON `auth_item_child`.`parent` = `rol`.`name` LEFT JOIN `auth_assignment` `rolasignacion` ON `rol`.`name` = `rolasignacion`.`item_name` WHERE permiso.type=2 AND rolasignacion.user_id='123456'

    public function getListaPermisos() {
      $query = self::find()
      ->joinwith(['children as permiso'])
      ->where('Auth_Item.type =:tipo and Auth_Item.name not in (select child from Auth_Item_Child where parent = "'.$this->name.'")')
      ->addParams([':tipo' => 2])
      ->asArray()
      ->all();
---
SELECT * FROM `auth_item` `rol` WHERE `name` IN ('intranet_admin', 'intranet_publicador')