modules/intranet/models/Contenido.php

SELECT `t_Contenido`.* FROM `t_Contenido` LEFT JOIN `t_ContenidoDestino` ON `t_Contenido`.`idContenido` = `t_ContenidoDestino`.`idContenido` WHERE  fechaInicioPublicacion<=now() AND fechaInicioPublicacion >='2016-08-29 09:01:46' AND idLineaTiempo ='1' AND estado=2 AND
    (
    (t_ContenidoDestino.codigoCiudad ='76001' AND t_ContenidoDestino.idGrupoInteres IN (999999)) OR
    (t_ContenidoDestino.codigoCiudad ='76001' AND t_ContenidoDestino.idGrupoInteres=999999 ) OR
    (t_ContenidoDestino.codigoCiudad =999999 AND t_ContenidoDestino.idGrupoInteres=999999 ) OR
    (t_ContenidoDestino.codigoCiudad =999999 AND t_ContenidoDestino.idGrupoInteres IN (999999))
    ) ORDER BY `fechaInicioPublicacion` DESC
---
    public static function traerNoticiaEspecifica($idContenido){
        return $noticias = Contenido::find()->with(['objUsuarioPublicacion', 'listComentarios', 'listAdjuntos','listMeGusta', 'listComentarios','listMeGustaUsuario', 'objDenuncioComentarioUsuario'])->where(
                           ['and',
                                ['<=', 'fechaInicioPublicacion', new Expression('now()')],
                                ['=', 'idContenido', $idContenido],
                                ['=', 'estado', self::APROBADO]
                             ]
                            )->one();