modules/intranet/models/ContenidoDestino.php

SELECT * FROM `m_GrupoInteres` ORDER BY `nombreGrupo`
---
  public function getListaGrupoInteres($bandera) {

    if ($bandera) {

      $opciones = GrupoInteres::find()->where(['estado'=>1])->orderBy('nombreGrupo')->asArray()->all();

      return ArrayHelper::map($opciones, 'idGrupoInteres', 'nombreGrupo');