modules/intranet/models/MenuPortales.php

SELECT `t_MenuPortales`.`idMenuPortales`, `t_MenuPortales`.`nombre`, `t_MenuPortales`.`icono`, `t_MenuPortales`.`tipo`, `t_MenuPortales`.`urlMenu` FROM `t_MenuPortales` LEFT JOIN `m_Portal` ON `t_MenuPortales`.`idPortal` = `m_Portal`.`idPortal` WHERE m_Portal.nombrePortal='intranet' AND t_MenuPortales.estado=1 AND t_MenuPortales.idMenuPortalPadre IS NULL
---
    public static function traerMenuPortalesIndex($portal) {
        $query = MenuPortales::find()
                ->select(['t_MenuPortales.idMenuPortales', 't_MenuPortales.nombre', 't_MenuPortales.icono', 't_MenuPortales.tipo', 't_MenuPortales.urlMenu'])
                ->joinWith(['objPortal'])
                ->where('m_Portal.nombrePortal=:portal AND t_MenuPortales.estado=:estado AND t_MenuPortales.idMenuPortalPadre IS NULL ')
                ->addParams([':estado' => self::APROBADO, ':portal' => $portal])
                ->all();

SELECT * FROM `m_Portal` WHERE 0=1
---
    public static function getPadres($idPortal) {
        return self::find()->where('idMenuPortalPadre is null and idPortal =:idPortal ') //and idMenuPortales !=:idMenuPortales
                        ->addParams([':idPortal' => $idPortal])
                        ->all();