modules/intranet/models/Menu.php

    public static function getMenuPadre($activo = true) {
        if ($activo){
            return self::find()->with('activeListSubMenu')->where('estado=1 AND idPadre is NULL')->orderBy('orden')->all();
        }else{
            return self::find()->with('listSubMenu')->where('estado=1 AND idPadre is NULL')->orderBy('orden')->all();
---
SELECT * FROM `t_Menu` WHERE (estado=1) AND (`idPadre` IN ('21', '1', '29', '33')) ORDER BY `orden`
SELECT * FROM `t_Menu` WHERE (estado=1) AND (`idPadre`='22') ORDER BY `orden`