modules/intranet/models/Notificaciones.php

SELECT `t_Notificaciones`.* FROM `t_Notificaciones` LEFT JOIN `m_Usuario` ON `t_Notificaciones`.`numeroDocumentoDirige` = `m_Usuario`.`numeroDocumento` LEFT JOIN `t_Contenido` ON `t_Notificaciones`.`idContenido` = `t_Contenido`.`idContenido` WHERE numeroDocumentoDirigido='123456' ORDER BY `fechaRegistro` DESC LIMIT 5
---
  public static function consultarNotificaciones($usuario, $dataProvider = false) {
    if ($dataProvider) {
      $query = self::find()
      ->joinWith(['objUsuarioDirige', 'objContenido'])
      ->where("numeroDocumentoDirigido=:usuario")
      ->addParams([':usuario' => $usuario])
      ->orderBy('fechaRegistro DESC');
    } else {
      $query = self::find()
      ->joinWith(['objUsuarioDirige', 'objContenido'])
      ->where("numeroDocumentoDirigido=:usuario")
      ->addParams([':usuario' => $usuario])
      ->limit(\Yii::$app->params['notificaciones']['limiteVisualizar'])
      ->orderBy('fechaRegistro DESC')->all();

SELECT * FROM `m_Usuario` WHERE `numeroDocumento` IN ('123456', '8724911', '1234567')
SELECT COUNT(*) FROM `t_Notificaciones` WHERE numeroDocumentoDirigido='123456' AND estadoNotificacion=1
---
  public static function cantidadNoVistas($usuario) {
    return (new \yii\db\Query())
    ->from(self::tableName())
    ->where('numeroDocumentoDirigido=:usuario AND estadoNotificacion=:estado')
    ->addParams([':usuario' => $usuario, ':estado'=>  self::ESTADO_CREADA])
    ->count();