modules/intranet/models/OpcionesUsuario.php

SELECT `m`.* FROM `t_Menu` `m` INNER JOIN `t_Opcion` `o` ON `m`.`idMenu` = `o`.`idMenu` WHERE m.estado=1 AND m.idMenu NOT IN(SELECT idMenu FROM t_UsuariosMenuInactivo WHERE numeroDocumento='123456')
---
  private function opcionesUsuario(){
    $this->opcionesUsuario = array();
    $listMenuFavorito = Menu::find()
            ->alias('m')
            ->innerJoinWith('objOpcion as o')
            ->where("m.estado=:estado AND m.idMenu NOT IN(SELECT idMenu FROM t_UsuariosMenuInactivo WHERE numeroDocumento=:usuario)", [':estado'=>1, ':usuario'=> $this->usuario])
            ->all();