modules/intranet/models/Parametros.php

SELECT `valorParametro` FROM `m_Parametros` WHERE ( idParametro='contenido_maxFileCount' )
---
    public static function obtenerValorParametro($idParametro)
    {
      $query = self::find()->select(['valorParametro'])
              ->where('( idParametro=:idParametro )')
              ->addParams([':idParametro' => $idParametro])
              ->one();