models/Usuario.php

SELECT * FROM `m_Usuario` WHERE (`idUsuario`='2') AND (`estado`=1)
---
    public static function listaUsuariosEnviarAmigo($idContenido) {
        //Usuario::find()->where([ 'estado' => 1])->andWhere(['<>', 'numeroDocumento', Yii::$app->user->identity->numeroDocumento])->all();
        $idUsuario = Yii::$app->user->identity->numeroDocumento;
        $fecha = Date("Y-m-d H:i:s");

        $query = self::find()->where("(estado=:estado
        and numeroDocumento not in (select numeroDocumentoDirigido from `t_ContenidoRecomendacion`
        where (`fechaRegistro` <=:fechaRegistro) and (`idContenido`=:idContenido))
        and numeroDocumento !=:idUsuario )")->addParams([':estado' => 1, ':idUsuario' => $idUsuario, ':fechaRegistro' => $fecha, ':idContenido' => $idContenido])->all();